<?php

/**
 * demo.php
 * Copyright (c) 2019 thegrumpydictator@gmail.com
 *
 * This file is part of Firefly III (https://github.com/firefly-iii).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as
 * published by the Free Software Foundation, either version 3 of the
 * License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Affero General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

declare(strict_types=1);

return [
    'no_demo_text'           => 'Συγγνώμη, δεν υπάρχει επεξήγηματικό κείμενο για <abbr title=":route">αυτή τη σελίδα</abbr>.',
    'see_help_icon'          => 'Ωστόσο, το <i class="fa fa-question-circle"></i>-εικονίδιο στην επάνω δεξιά γωνία θα σας πει περισσότερα.',
    'index'                  => 'Καλωσορίσατε στο <strong>Firefly III</strong>! Σε αυτή τη σελίδα θα λάβετε μια σύνοψη των οικονομικών σας. Για περισσότερες πληροφορίες, ελέγξτε τους Λογαριασμούς &rarr; <a href=":asset">Πάγιοι Λογαριασμοί</a> και φυσικά τους <a href=":budgets">Προϋπολογισμούς</a> και τις σελίδες <a href=":reports">Αναφορών</a>. Ή περιηγηθείτε και δείτε που θα καταλήξετε.',
    'accounts-index'         => 'Οι αποταμιευτικοί λογαριασμοί είναι οι προσωπικοί σας τραπεζικοί λογαριασμοί. Λογαριασμοί εξόδων είναι οι λογαριασμοί που ξοδεύετε χρήματα, όπως καταστήματα και φίλοι. Λογαριασμοί εσόδων είναι λογαριασμοί από τους οποίους λαμβάνετε χρήματα, όπως η εργασία σας, η κυβέρνηση ή άλλες πηγές εισοδημάτων. Οι υποχρεώσεις είναι οι οφειλές και τα δάνεια όπως παλιές οφειλές πιστωτικών καρτών ή οικιακά δάνεια. Σε αυτή τη σελίδα μπορείτε να τους διαμορφώσετε ή να τους αφαιρέσετε.',
    'budgets-index'          => 'Αυτή η σελίδα εμφανίζει μια σύνοψη των προϋπολογισμών σας. Η επάνω μπάρα δείχνει το ποσό που είναι διαθέσιμο προς προϋπολογισμό. Αυτό μπορεί να διαμορφωθεί για οποιαδήποτε περίοδο κλικάροντας το ποσό στα δεξιά. Το ποσό που ξοδεύετε πραγματικά εμφανίζεται στην παρακάτω μπάρα. Από κάτω είναι τα έξοδα ανά προϋπολογισμό και προϋπολογίσατε για αυτούς.',
    'reports-index-start'    => 'Το Firefly III υποστηρίζει μια πληθώρα τύπων αναφορών. Διαβάστε για αυτές κλικάροντας το <i class="fa fa-question-circle"></i>-εικονίδιο στην επάνω δεξιά γωνία.',
    'reports-index-examples' => 'Ελέγξτε οπωσδήποτε αυτά τα παραδείγματα: <a href=":one">μια μηνιαία οικονομική σύνοψη </a>, <a href=":two">μια ετήσια οικονομική σύνοψη</a> και <a href=":three">μια σύνοψη προϋπολογισμού</a>.',
    'currencies-index'       => 'Το Firefly III υποστηρίζει πολλαπλά νομίσματα. Αν και προρυθμίζεται στο Ευρώ μπορεί να οριστεί σε Αμερικάνικο Δολλάριο και πολλά άλλα νομίσματα. Όπως βλέπετε μια μικρή επιλογή νομισμάτων έχει περιληφθεί και μπορείτε να προσθέσετε τα δικά σας εάν επιθυμείτε. Αλλάζοντας το προκαθορισμένο νόμισμα δε θα αλλάξει το νόμισμα των υπαρχόντων συναλλαγών: To Firefly III υποστηρίζει τη ταυτόχρονη χρήση πολλαπλών νομισμάτων.',
    'transactions-index'     => 'Αυτά τα έξοδα, οι καταθέσεις και οι μεταφορές δεν είναι ιδιαιτέρως φανταστικές. Έχουν δημιουργηθεί αυτόματα.',
    'piggy-banks-index'      => 'Όπως βλέπετε, υπάρχουν τρεις κουμπαράδες. Χρησιμοποιήστε τα κουμπιά συν και μείον για να επηρρεάσετε το ποσό των χρημάτων σε κάθε κουμπαρά. Κλικάρετε το όνομα του κουμπαρά για να δείτε τη διαχείρηση για κάθε κουμπαρά.',
    'import-index'           => 'Κάθε αρχείο CSV μπορεί να εισαχθεί στο Firefly III. Επίσης υποστηρίζει εισαγωγή δεδομένων από το bunq και το Spectre. Άλλες τράπεζες και χρηματοπιστωτικοί συγκεντρωτές θα εφαρμοστούν μελλοντικά. Ως χρήστης-demo ωστόσο, μπορείτε να δείτε τον "ψεύτικο"-παροχο σε λειτουργία. Θα δημιουργήσει κάποιες τυχαίες συναλλαγές για να σας δείξει πως λειτουργεί η διαδικασία.',
    'profile-index'          => 'Λάβετε υπόψιν ότι o δοκιμαστικός ιστότοπος επαναφέρεται κάθε τέσσερις ώρες. Η πρόσβασή σας μπορεί να ανακληθεί οποιαδήποτε στιγμή. Αυτό συμβαίνει αυτόματα και δεν είναι σφάλμα.',
];
