<?php

/**
 * intro.php
 * Copyright (c) 2019 thegrumpydictator@gmail.com
 *
 * This file is part of Firefly III (https://github.com/firefly-iii).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as
 * published by the Free Software Foundation, either version 3 of the
 * License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Affero General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

declare(strict_types=1);

return [
    // index
    'index_intro'                                     => 'Καλωσορίσατε στη σελίδα ευρετηρίου του Firefly III. Παρακαλούμε πάρτε το χρόνο σας με αυτή την εισαγωγή για να κατανοήσετε πως λειτουργεί το Firefly III.',
    'index_accounts-chart'                            => 'Αυτό το γράφημα δείχνει τo τρέχων υπόλοιπο των ενεργών λογαριασμών σας. Μπορείτε να επιλέξετε τους λογαριασμούς που εμφανίζονται εδώ στις προτιμήσεις σας.',
    'index_box_out_holder'                            => 'Αυτό το μικρό πλαίσιο και τα παρακείμενα πλαίσια σας δίνουν μια σύνοψη της οικονομικής σας κατάστασης.',
    'index_help'                                      => 'Εάν ποτέ χρειαστείτε βοήθεια με μια σελίδα ή φόρμα, πιέστε αυτό το κουμπί.',
    'index_outro'                                     => 'Οι περισσότερες σελίδες του Firefly III θα ξεκινήσουν με μια μικρή περιήφηση όπως αυτή. Παρακαλώ επικοινωνήστε μαζί μου όταν έχετε ερωτήσεις ή σχόλια. Απολαύστε!',
    'index_sidebar-toggle'                            => 'Για τη δημιουργία νέων συναλλαγών, λογαριασμών ή άλλων αντικειμένων, χρησιμοποιήστε το μενού κάτω από αυτό το εικονίδιο.',
    'index_cash_account'                              => 'Αυτοί είναι οι δημιουργημένοι λογαριασμοί ως τώρα. Μπορείτε να χρησιμοποιήσετε το λογαριασμό μετρητών για την παρακολούθηση εξόδων αλλά δεν είναι υποχρεωτικό ασφαλώς.',

    // transactions (withdrawal)
    'transactions_create_withdrawal_source'           => 'Επιλέξτε τον αγαπημένο σας αποταμιευτικό λογαριασμό ή υποχρέωση από αυτή τη λίστα.',
    'transactions_create_withdrawal_destination'      => 'Επιλέξτε εδώ έναν λογαριασμό εξόδων. Αφήστε το κενό εάν θέλετε να κάνετε ένα έξοδο με μετρητά.',
    'transactions_create_withdrawal_foreign_currency' => 'Χρησιμοποιήστε αυτό το πεδίο για να ορίσετε ένα ξένο νόμισμα και ποσό.',
    'transactions_create_withdrawal_more_meta'        => 'Σε αυτά τα πεδία ορίζετε πληθώρα άλλων μεταδεδομένων.',
    'transactions_create_withdrawal_split_add'        => 'Έαν θέλετε να διαχωρίσετε μια συναλλαγή, προσθέστε περισσότερους διαχωρισμούς με αυτό το κουμπί',

    // transactions (deposit)
    'transactions_create_deposit_source'              => 'Επιλέξτε ή πληκτρολογήστε τον πληρωτή σε αυτό το σε αυτή την αυτοματοποιημένη λίστα/κουτάκι. Αφήστε το κενό εάν θέλετε να κάνετε μια κατάθεση μετρητών.',
    'transactions_create_deposit_destination'         => 'Επιλέξτε έναν λογαριασμό αποταμίευσης ή υποχρεώσεων εδώ.',
    'transactions_create_deposit_foreign_currency'    => 'Χρησιμοποιήστε αυτό το πεδίο για να ορίσετε ένα ξένο νόμισμα και ποσό.',
    'transactions_create_deposit_more_meta'           => 'Σε αυτά τα πεδία ορίζετε πληθώρα άλλων μεταδεδομένων.',
    'transactions_create_deposit_split_add'           => 'Έαν θέλετε να διαχωρίσετε μια συναλλαγή, προσθέστε περισσότερους διαχωρισμούς με αυτό το κουμπί',

    // transactions (transfer)
    'transactions_create_transfer_source'             => 'Επιλέξτε τον αποταμιευτικό λογαριασμό προέλευσης εδώ.',
    'transactions_create_transfer_destination'        => 'Επιλέξτε τον αποταμιευτικό λογαριασμό προορισμού εδώ.',
    'transactions_create_transfer_foreign_currency'   => 'Χρησιμοποιήστε αυτό το πεδίο για να ορίσετε ένα ξένο νόμισμα και ποσό.',
    'transactions_create_transfer_more_meta'          => 'Σε αυτά τα πεδία ορίζετε πληθώρα άλλων μεταδεδομένων.',
    'transactions_create_transfer_split_add'          => 'Έαν θέλετε να διαχωρίσετε μια συναλλαγή, προσθέστε περισσότερους διαχωρισμούς με αυτό το κουμπί',

    // create account:
    'accounts_create_iban'                            => 'Δώστε στους λογαριασμού σας έναν έγκυρο IBAN. Αυτό θα κάνει την εισαγωγή δεδομένων πολύ πιο εύκολη στο μέλλον.',
    'accounts_create_asset_opening_balance'           => 'Οι αποταμιευτικοί λογαριασμοί μπορεί να έχουν ένα "αρχικό υπόλοιπο", καταδεικνύωντας την αρχή του ιστορικού αυτού του λογαριασμού στο Firefly III.',
    'accounts_create_asset_currency'                  => 'Το Firefly III υποστηρίζει πολλαπλά νομίσματα. Οι αποταμιευτικοί λογαριασμοί έχουν ένα κύριο νόμισμα, που πρέπει να ορίσετε εδώ.',
    'accounts_create_asset_virtual'                   => 'Κάποιες φορές βοηθάει να δώσετε στο λογαριασμό σας ένα εικονικό υπόλοιπο: ένα έξτρα ποσό πάντα προστείθεται ή αφαιρείται από το πραγματικό υπόλοιπο.',

    // budgets index
    'budgets_index_intro'                             => 'Οι προϋπολογισμοί χρησιμοποιούνται για τη διαχείρηση των οικονομικών σας και σχηματίζουν μία από τις κεντρικές λειτουργίες του Firefly III.',
    'budgets_index_set_budget'                        => 'Ορίστε το συνολικό σας προϋπολογισμό για κάθε περίοδο ώστε να μπορεί το Firefly III να σας πει εάν έχετε προϋπολογίσει όλα τα διαθέσιμα χρήματα.',
    'budgets_index_see_expenses_bar'                  => 'Το ξόδεμα των χρημάτων θα γεμίσει σιγά σιγά αυτή την μπάρα.',
    'budgets_index_navigate_periods'                  => 'Περιηγηθείτε ανάμεσα σε περιόδους για να ορίσετε εύκολα προϋπολογισμούς πριν την ώρα τους.',
    'budgets_index_new_budget'                        => 'Δημιουργήστε νέους προϋπολογισμούς κατά βούληση.',
    'budgets_index_list_of_budgets'                   => 'Χρησιμοποιήστε αυτό τον πίνακα για να ορίσετε τα ποσά για κάθε προϋπολογισμό και την πρόοδό σας.',
    'budgets_index_outro'                             => 'Για να μάθετε περισσότερα για προϋπολογισμούς, ελέγξτε το εικονίδιο βοήθειας στην επάνω δεξιά γωνία.',

    // reports (index)
    'reports_index_intro'                             => 'Χρησιμοποιήστε αυτές τις αναφορές για να λάβετε λεπτομερείς πληροφορίες για τα οικονομικά σας.',
    'reports_index_inputReportType'                   => 'Επιλέξτε έναν τύπο αναφοράς. Ελέγξτε τις σελίδες βοήθειας για να δείτε τί εμφανίζει ή κάθε αναφορά.',
    'reports_index_inputAccountsSelect'               => 'Μπορείτε να παραλείψετε ή να συμπεριλάβετε αποταμιευτικούς λογαριασμούς κατά βούληση.',
    'reports_index_inputDateRange'                    => 'Το επιλεγμένο εύρος ημερομηνιών εξαρτάται αποκλειστικά από εσάς: από μία ημέρα εώς 10 χρόνια.',
    'reports_index_extra-options-box'                 => 'Αναλόγως της αναφοράς που έχετε επιλέξει, μπορείτε να επιλέξετε επιπλέον φίλτρα και επιλογές εδώ. Παρακολουθήστε αυτό το πλαίσιο όταν αλλάζετε τύπους αναφορών.',

    // reports (reports)
    'reports_report_default_intro'                    => 'Αυτή η αναφορά σας δίνει μια γρήγορη και εμπεριστατωμένη σύνοψη των οικονομικών σας. Εάν επιθυμείτε να βλέπετε και κάτι άλλο, παρακαλώ μη διστάσετε να επικοινωνήσετε μαζί μου!',
    'reports_report_audit_intro'                      => 'Αυτή η αναφορά θα σας δώσει λεπτομερείς πληροφορίες για τους αποταμιευτικούς σας λογαριασμούς.',
    'reports_report_audit_optionsBox'                 => 'Χρησιμοποιήστε αυτά τα πλαίσια ελέγχου για την εμφάνιση ή απόκρυψη στηλών που σας ενδιαφέρουν.',

    'reports_report_category_intro'                  => 'Αυτή η αναφορά θα σας δώσει πληροφορίες για μία ή πολλαπλές κατηγορίες.',
    'reports_report_category_pieCharts'              => 'Αυτά τα γραφήματα θα σας δώσουν πληροφορίες για έξοδα και έσοδα ανά κατηγορία ή ανά λογαριασμό.',
    'reports_report_category_incomeAndExpensesChart' => 'Αυτό το γράφημα σας δείχνει έξοδα και έσοδα ανά κατηγορία.',

    'reports_report_tag_intro'                  => 'Αυτή η αναφορά θα σας δώσει πληροφορίες για μία ή πολλαπλές ετικέτες.',
    'reports_report_tag_pieCharts'              => 'Αυτά τα γραφήματα θα σας δώσουν πληροφορίες για έξοδα και έσοδα ανά ετικέτα, λογαριασμό, κατηγορία ή προϋπολογισμό.',
    'reports_report_tag_incomeAndExpensesChart' => 'Αυτό το γράφημα σας δείχνει έξοδα και έσοδα ανά ετικέτα.',

    'reports_report_budget_intro'                             => 'Αυτή η αναφορά θα σας δώσει πληροφορίες για ένα ή πολλαπλούς προϋπολογισμούς.',
    'reports_report_budget_pieCharts'                         => 'Αυτά τα γραφήματα θα σας δώσουν πληροφορίες για έξοδα ανά προϋπολογισμό ή ανά λογαριασμό.',
    'reports_report_budget_incomeAndExpensesChart'            => 'Αυτό το γράφημα σας δείχνει έξοδα ανά προϋπολογισμό.',

    // create transaction
    'transactions_create_switch_box'                          => 'Χρησιμοποιήστε αυτά τα κουμπιά για την γρήγορη εναλλαγή του τύπου συναλλαγής που επιθυμείτε να αποθηκεύσετε.',
    'transactions_create_ffInput_category'                    => 'Μπορείτε να πληκτρολογήσετε ελεύθερα σε αυτό το πεδίο. Κατηγορίες που έχουν δημιουργηθεί παλαιότερα θα προταθούν.',
    'transactions_create_withdrawal_ffInput_budget'           => 'Συνδέστε την ανάληψή σας σε ένα προϋπολογισμό για καλύτερο οικονομικό έλεγχο.',
    'transactions_create_withdrawal_currency_dropdown_amount' => 'Χρησιμοποιήστε αυτή τη λίστα όταν η ανάληψή σας είναι σε άλλο νόμισμα.',
    'transactions_create_deposit_currency_dropdown_amount'    => 'Χρησιμοποιήστε αυτή τη λίστα όταν η κατάθεσή σας είναι σε άλλο νόμισμα.',
    'transactions_create_transfer_ffInput_piggy_bank_id'      => 'Επιλέξτε έναν κουμπαρά και συνδέστε αυτή τη μεταφορά στις αποταμιεύσεις σας.',

    // piggy banks index:
    'piggy-banks_index_saved'                                 => 'Αυτό το πεδίο σας δείχνει πόσα έχετε εξοικονομήσει σε κάθε κουμπαρά.',
    'piggy-banks_index_button'                                => 'Διπλά από αυτή τη γραμμή προόδου υπάρχουν δύο κουμπιά (+ και -) για να προσθέσετε ή να αφαιρέσετε χρήματα από κάθε κουμπαρά.',
    'piggy-banks_index_accountStatus'                         => 'Για κάθε πάγιο λογαριασμό με τουλάχιστον ένα κουμπαρά η κατάσταση αναφέρεται σε αυτό τον πίνακα.',

    // create piggy
    'piggy-banks_create_name'                                 => 'Ποιός είναι ο στόχος σας; Ένας νέος καναπές, μια κάμερα, χρήματα για έκτακτες ανάγκες;',
    'piggy-banks_create_date'                                 => 'Μπορείτε να ορίσετε μια ημερομηνία επίτευξης στόχου ή μια προθεσμία για τον κουμπαρά σας.',

    // show piggy
    'piggy-banks_show_piggyChart'                             => 'Αυτό το γράφημα θα δείξει το ιστορικό αυτού του κουμπαρά.',
    'piggy-banks_show_piggyDetails'                           => 'Κάποιες λεπτομέρειες για τον κουμπαρά σας',
    'piggy-banks_show_piggyEvents'                            => 'Όποιεσδήποτε προσθήκες ή αφαιρέσεις αναφέρονται εδώ επίσης.',

    // bill index
    'bills_index_rules'                                       => 'Εδώ βλέπετε ποιοί κανόνες θα ελέγξουν εάν αυτός ο λογαριασμός έχει εκδοθεί',
    'bills_index_paid_in_period'                              => 'Αυτό το πεδίο υποδεικνύει πότε ο λογαριασμός πληρώθηκε τελευταία φορά.',
    'bills_index_expected_in_period'                          => 'Αυτό το πεδίο υποδεικνύει για κάθε λογαριασμό, εάν και πότε αναμένεται να εκδοθεί ο επόμενος λογαριασμός.',

    // show bill
    'bills_show_billInfo'                                     => 'Αυτός ο πίνακας δείχνει κάποιες γενικές πληροφορίες για αυτό το λογαριασμό.',
    'bills_show_billButtons'                                  => 'Χρησιμοποιήστε αυτό το κουμπί για επανασάρωση παλιών συναλλαγών για να αντιπαραβαλλούν σε αυτό το λογαριασμό.',
    'bills_show_billChart'                                    => 'Αυτό το γράφημα δείχνει τις συναλλαγές που έχουν συνδεθεί με αυτό το λογαριασμό.',

    // create bill
    'bills_create_intro'                                      => 'Χρησιμοποιήστε λογαριασμούς για να παρακολουθήσετε το ποσό των οφειλόμενων χρημάτων κάθε περιόδου. Σκεφείτε έξοδα όπως ενοίκιο, ασφάλεια ή πληρωμές δόσεων.',
    'bills_create_name'                                       => 'Χρησιμοποιήστε ένα περιγραφικό όνομα όπως "Ενοίκιο" ή "Ασφάλεια υγείας".',
    //'bills_create_match'                                      => 'To match transactions, use terms from those transactions or the expense account involved. All words must match.',
    'bills_create_amount_min_holder'                          => 'Επιλέξτε ένα ελάχιστο και μέγιστο ποσό για αυτό το λογαριασμό.',
    'bills_create_repeat_freq_holder'                         => 'Οι περισσότεροι λογαριασμοί επαναλαμβάνονται μηνιαίως αλλά μπορείτε να ορίσετε άλλη συχνότητα εδώ.',
    'bills_create_skip_holder'                                => 'Εάν ένας λογαριασμός εκδίδεται κάθε 2 εβδομάδες, το πεδίο-"παράληψη" πρέπει να οριστεί σε "1" για την παράλειψη κάθε άλλης εβδομάδος.',

    // rules index
    'rules_index_intro'                                       => 'To Firefly III σας επιτρέπει να διαχειρίζεστε κανόνες, που θα εφαρμοστούν αυτόματα σε κάθε συναλλαγή που δημιουργείτε ή επεξεργάζεστε.',
    'rules_index_new_rule_group'                              => 'Μπορείτε να συνδυάσετε κανόνες σε ομάδες για ευκολότερη διαχείριση.',
    'rules_index_new_rule'                                    => 'Δημιουργήστε όσους κανόνες επιθυμείτε.',
    'rules_index_prio_buttons'                                => 'Ταξινομήστε τους όπως εσείς θεωρείτε βολικό.',
    'rules_index_test_buttons'                                => 'Μπορείτε να ελέγξετε τους κανόνες σας ή να τους εφαρμόσετε σε υπάρχουσες συναλλαγές.',
    'rules_index_rule-triggers'                               => 'Οι κανόνες έχουν "σκανδάλες" και "ενέργειες" που μπορείτε να ταξινομήσετε σύροντας-και-αποθέτοντας.',
    'rules_index_outro'                                       => 'Βεβαιωθείτε να ελέγξετε τις σελίδες βοήθειας χρησιμοποιώντας το (?) εικονίδιο επάνω αριστερά!',

    // create rule:
    'rules_create_mandatory'                                  => 'Επιλέξτε έναν περιγραφικό τίτλο, και ορίστε πότε ο κανόνας θα εκτελείται.',
    'rules_create_ruletriggerholder'                          => 'Προσθέστε όσες σκανδάλες θέλετε, αλλά θυμηθείται ότι ΟΛΕΣ οι σκανδάλες πρέπει να ταιριάξουν πριν οποιαδήποτε ενέργεια εκτελεστεί.',
    'rules_create_test_rule_triggers'                         => 'Χρησιμοποιήστε αυτό το κουμπί για να δείτε ποιές συναλλαγές θα ταίριαζαν με τον κανόνα σας.',
    'rules_create_actions'                                    => 'Ορίστε όσες ενέργειες επιθυμείτε.',

    // preferences
    'preferences_index_tabs'                                  => 'Περισσότερες επιλογές είναι διαθέσιμες πίσω από αυτές τις καρτέλες.',

    // currencies
    'currencies_index_intro'                                  => 'Το Firefly III υποστηρίζει πολλαπλά νομίσματα, που μπορείτε να αλλάξετε σε αυτή τη σελίδα.',
    'currencies_index_default'                                => 'Το Firefly III έχει ένα προκαθορισμένο νόμισμα.',
    'currencies_index_buttons'                                => 'Χρησιμοποιήστε αυτά τα πλήκτρα για να αλλάξετε το προκαθορισμένο νόμισμα ή να ενεργοποιήσετε άλλα νομίσματα.',

    // create currency
    'currencies_create_code'                                  => 'Αυτός ο κώδικας πρέπει να είναι ISO αποδεκτός (Κάντε το google για το νέο σας νόμισμα).',
];
